# vim: syntax=ruby filetype=ruby
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-drivers"

brew "ansible"
brew "awscli"
brew "bash"
brew "bat"
brew "bitwarden-cli"
brew "dockutil"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "figlet"
brew "ffmpeg"
brew "fluxcd/tap/flux"
brew "fzf"
brew "gettext"
brew "gh"
brew "git"
brew "git-crypt"
brew "glib"
brew "gopass"                   # https://github.com/gopasspw/gopass
brew "gnupg2"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnu-sed"
brew "gnu-indent"
brew "gawk"
brew "grep"
brew "gnutls"
brew "gnu-getopt"
brew "go"
brew "graphviz"
brew "grpc"
brew "heroku/brew/heroku"
brew "htop"
brew "hugo"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kustomize"
brew "kubectx"
brew "less"
brew "ncurses"
brew "node"
brew "nvim"
brew "openssl"
brew "openssh"
brew "protobuf"
# brew "python@3.9"             # Don't install python versions via homebrew
brew "ripgrep"
brew "ruby"
brew "rust"
brew "shellcheck"
brew "sphinx-doc"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "vagrant"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yarn"

cask "cryptomator"              # enc vault
cask "docker"                   # docker desktop
cask "google-cloud-sdk"
cask "google-chrome"
cask "iterm2"
cask "multipass"
cask "notion"
cask "obsidian"                 # obsidian md
cask "slack"
cask "spotify"
cask "telegram"
# cask "virtualbox"             # not compatible with M1
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Optional
# cask "keycastr"
